wolfSSL/wolfBoot/hal/mcxn.c
/* mcxn.c
 *
 * Copyright (C) 2026 wolfSSL Inc.
 *
 * This file is part of wolfBoot.
 *
 * wolfBoot is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 3 of the License, or
 * (at your option) any later version.
 *
 * wolfBoot is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1335, USA
 */

#include <stdint.h>
#include <string.h>
#include <target.h>
#include "fsl_common.h"
#include "image.h"

#include "clock_config.h"
#include "fsl_clock.h"
#include "fsl_flash.h"
#include "fsl_gpio.h"
#include "fsl_lpflexcomm.h"
#include "fsl_lpuart.h"
#include "fsl_port.h"
#include "fsl_reset.h"
#include "loader.h"
#include "PERI_AHBSC.h"

#ifdef TZEN
#include "hal/armv8m_tz.h"
#endif

#if defined(WOLFCRYPT_TZ_PSA)
/* 128-bit device UUID in IPC 1 (SYSCON UUID block) */
#define MCXN_UUID_ADDR  0x01100000U
#endif

#if defined(WOLFCRYPT_TZ_PSA) && defined(WOLFBOOT_DICE_HW)
#include "wolfboot/dice.h"
#include "mcuxClEls.h"
#include "mcuxClEls_Kdf.h"
#include "mcuxClEls_Ecc.h"
#include "mcuxClEls_KeyManagement.h"
#include "mcuxCsslFlowProtection.h"
#include <wolfssl/wolfcrypt/sha256.h>

/* Key slot pre-loaded by ROM DICE: HKDF(UDS, wolfBoot_hash) -> initial CDI. */
#define MCXN_ELS_DICE_CDI_INITIAL_KEYSLOT   7U

/* wolfBoot stores the boot-measurement-derived CDI here. */
#define MCXN_ELS_DICE_CDI_DERIVED_KEYSLOT   11U

/* wolfBoot stores the per-boot IAK (P-256) here.
 * ELS EccKeyGen DETERMINISTIC mode uses privateKeyIdx as both the CDI seed
 * source and the IAK output slot, so the IAK overwrites the CDI in-place. */
#define MCXN_ELS_DICE_IAK_KEYSLOT           MCXN_ELS_DICE_CDI_DERIVED_KEYSLOT

#endif

#if defined(WOLFCRYPT_TZ_PSA) && !defined(WOLFBOOT_DICE_HW)
#include <wolfssl/wolfcrypt/sha256.h>
#include <wolfssl/wolfcrypt/sha512.h>

#ifdef WOLFBOOT_UDS_UID_FALLBACK_FORTEST
static NOINLINEFUNCTION void hal_uds_zeroize(void *ptr, size_t len)
{
    volatile uint8_t *p = (volatile uint8_t *)ptr;
    while (len-- > 0U)
        *p++ = 0U;
}
#endif

/* Derive UDS from device UUID for software DICE testing.
 * NOT secure — UUID is publicly observable. Only enabled with
 * WOLFBOOT_UDS_UID_FALLBACK_FORTEST. */
int hal_uds_derive_key(uint8_t *out, size_t out_len)
{
    volatile const uint32_t *uuid_addr =
        (volatile const uint32_t *)MCXN_UUID_ADDR;
    uint8_t uuid_be[16];
    uint32_t word;
    int i;
#if defined(WOLFBOOT_HASH_SHA384)
    wc_Sha384 hash;
    uint8_t digest[SHA384_DIGEST_SIZE];
    size_t copy_len = sizeof(digest);
#elif defined(WOLFBOOT_HASH_SHA256)
    wc_Sha256 hash;
    uint8_t digest[SHA256_DIGEST_SIZE];
    size_t copy_len = sizeof(digest);
#else
    (void)out; (void)out_len;
    return -1;
#endif

    if (out == NULL || out_len == 0)
        return -1;

#ifndef WOLFBOOT_UDS_UID_FALLBACK_FORTEST
    (void)uuid_addr; (void)uuid_be; (void)word; (void)i;
#if defined(WOLFBOOT_HASH_SHA384) || defined(WOLFBOOT_HASH_SHA256)
    (void)hash; (void)digest; (void)copy_len;
#endif
    return -1;
#else
    for (i = 0; i < 4; i++) {
        word = uuid_addr[i];
        uuid_be[i * 4 + 0] = (uint8_t)(word >> 24);
        uuid_be[i * 4 + 1] = (uint8_t)(word >> 16);
        uuid_be[i * 4 + 2] = (uint8_t)(word >> 8);
        uuid_be[i * 4 + 3] = (uint8_t)(word);
    }

#if defined(WOLFBOOT_HASH_SHA384)
    {
        int ret = wc_InitSha384(&hash);
        if (ret == 0) {
            ret = wc_Sha384Update(&hash, uuid_be, sizeof(uuid_be));
            if (ret == 0)
                ret = wc_Sha384Final(&hash, digest);
            wc_Sha384Free(&hash);
        }
        if (ret != 0) {
            hal_uds_zeroize(uuid_be, sizeof(uuid_be));
            hal_uds_zeroize(digest, sizeof(digest));
            return -1;
        }
    }
#elif defined(WOLFBOOT_HASH_SHA256)
    {
        int ret = wc_InitSha256(&hash);
        if (ret == 0) {
            ret = wc_Sha256Update(&hash, uuid_be, sizeof(uuid_be));
            if (ret == 0)
                ret = wc_Sha256Final(&hash, digest);
            wc_Sha256Free(&hash);
        }
        if (ret != 0) {
            hal_uds_zeroize(uuid_be, sizeof(uuid_be));
            hal_uds_zeroize(digest, sizeof(digest));
            return -1;
        }
    }
#endif

    if (copy_len > out_len)
        copy_len = out_len;
    XMEMCPY(out, digest, copy_len);
    hal_uds_zeroize(digest, sizeof(digest));
    hal_uds_zeroize(uuid_be, sizeof(uuid_be));
    return 0;
#endif /* WOLFBOOT_UDS_UID_FALLBACK_FORTEST */
}
#endif /* WOLFCRYPT_TZ_PSA && !WOLFBOOT_DICE_HW */

#ifdef WOLFCRYPT_SECURE_MODE
void hal_trng_init(void);
int hal_trng_get_entropy(unsigned char *out, unsigned int len);
#endif

static flash_config_t pflash;
static uint32_t pflash_sector_size = WOLFBOOT_SECTOR_SIZE;
uint32_t SystemCoreClock;

#ifdef TZEN
static void hal_sau_init(void)
{
    /* Non-secure callable area */
    sau_init_region(0, WOLFBOOT_NSC_ADDRESS,
            WOLFBOOT_NSC_ADDRESS + WOLFBOOT_NSC_SIZE - 1, 1);

    /* Non-secure: application flash area (boot partition) */
    sau_init_region(1, WOLFBOOT_PARTITION_BOOT_ADDRESS,
            WOLFBOOT_PARTITION_BOOT_ADDRESS + WOLFBOOT_PARTITION_SIZE - 1,
            0);

    /* Non-secure RAM */
    sau_init_region(2, 0x20020000, 0x20025FFF, 0);

    /* Peripherals */
    sau_init_region(3, 0x40000000, 0x4005FFFF, 0);
    sau_init_region(4, 0x40080000, 0x400DFFFF, 0);
    sau_init_region(5, 0x40100000, 0x4013FFFF, 0);

    /* Enable SAU */
    SAU_CTRL = SAU_INIT_CTRL_ENABLE;

    /* Enable securefault handler */
    SCB_SHCSR |= SCB_SHCSR_SECUREFAULT_EN;
}

static void periph_unsecure(void)
{
    CLOCK_EnableClock(kCLOCK_Gpio0);
    CLOCK_EnableClock(kCLOCK_Gpio1);
    CLOCK_EnableClock(kCLOCK_Port0);
    CLOCK_EnableClock(kCLOCK_Port1);

    GPIO_EnablePinControlNonSecure(GPIO0, (1UL << 10) | (1UL << 27));
    GPIO_EnablePinControlNonSecure(GPIO1, (1UL << 2) | (1UL << 8) | (1UL << 9));
}
#endif

void hal_init(void)
{
#ifdef __WOLFBOOT
    /* Single-byte RAM writes unpredictably fail when ECC is enabled */
    SYSCON->ECC_ENABLE_CTRL = 0;
    BOARD_InitBootClocks();
#ifdef DEBUG_UART
    uart_init();
#endif
#endif

#if defined(__WOLFBOOT) || !defined(TZEN)
    memset(&pflash, 0, sizeof(pflash));
    FLASH_Init(&pflash);
    FLASH_GetProperty(&pflash, kFLASH_PropertyPflashSectorSize,
            &pflash_sector_size);
#endif

#if defined(TZEN) && !defined(NONSECURE_APP)
    hal_sau_init();
#endif

