wolfSSL/wolfBoot/hal/mcxn.c
    XMEMSET(deriv, 0, sizeof(deriv));
#ifdef DEBUG
    wolfBoot_printf("[DICE] update_cdi: ret=%d\r\n", ret);
#endif
    return ret;
}

/* Generate P-256 IAK from derived CDI using ELS KEYGEN.
 * Private key stays in ELS keystore. Public key written to system memory. */
int hal_dice_create_attest_key(void)
{
    uint8_t pub_key[64] __attribute__((aligned(4)));
    mcuxClEls_EccKeyGenOption_t opts = {0};
    mcuxClEls_KeyProp_t props = {0};
    int ret = 0;

    s_dice_attest_pubkey_valid = 0;
    XMEMSET(s_dice_attest_pubkey, 0, sizeof(s_dice_attest_pubkey));
#ifdef DEBUG
    wolfBoot_printf("[DICE] create_attest_key: start\r\n");
#endif

    /* No KeyDelete here: DETERMINISTIC EccKeyGen reads the CDI from
     * IAK_KEYSLOT (= CDI_DERIVED_KEYSLOT) as its seed input.
     * Deleting that slot first would destroy the source material. */

    /* Set KeyGen options */
    opts.bits.kgsrc    = MCUXCLELS_ECC_OUTPUTKEY_DETERMINISTIC;
    opts.bits.kgtypedh = MCUXCLELS_ECC_OUTPUTKEY_SIGN;

    /* Set key properties */
    props.bits.upprot_priv = MCUXCLELS_KEYPROPERTY_PRIVILEGED_TRUE;
    props.bits.upprot_sec = MCUXCLELS_KEYPROPERTY_SECURE_TRUE;
    props.bits.uecsg = MCUXCLELS_KEYPROPERTY_ECC_TRUE;
    props.bits.uksk = MCUXCLELS_KEYPROPERTY_KSK_TRUE;
    props.bits.fgp = MCUXCLELS_KEYPROPERTY_GENERAL_PURPOSE_SLOT_TRUE;
    props.bits.kbase = MCUXCLELS_KEYPROPERTY_BASE_SLOT;
    props.bits.kactv = MCUXCLELS_KEYPROPERTY_ACTIVE_TRUE;
    props.bits.ksize = MCUXCLELS_KEYPROPERTY_KEY_SIZE_256;

#ifdef DEBUG
    wolfBoot_printf("[DICE] create_attest_key: EccKeyGen"
                    " CDI_DERIVED_SLOT=%d IAK_SLOT=%d\r\n",
                    MCXN_ELS_DICE_CDI_DERIVED_KEYSLOT,
                    MCXN_ELS_DICE_IAK_KEYSLOT);
#endif

    /* Trigger the ECC KeyGen command.
     * We just give the names of token and return value
     * since it's declared within the macro */
    MCUX_CSSL_FP_FUNCTION_CALL_BEGIN(res_kg, tok_kg,
        mcuxClEls_EccKeyGen_Async(opts,
            MCXN_ELS_DICE_CDI_DERIVED_KEYSLOT,
            MCXN_ELS_DICE_IAK_KEYSLOT,
            props, NULL, pub_key));

    if ((MCUX_CSSL_FP_FUNCTION_CALLED(mcuxClEls_EccKeyGen_Async) != tok_kg) ||
        (MCUXCLELS_STATUS_OK_WAIT != res_kg)) {
#ifdef DEBUG
            wolfBoot_printf("[DICE] create_attest_key: EccKeyGen_Async failed"
                            " res=0x%x tok=0x%x\r\n",
                            (unsigned)res_kg, (unsigned)tok_kg);
#endif
            ret = -1;
    }

    MCUX_CSSL_FP_FUNCTION_CALL_END();

    /* Wait for hardware to finish */
    if (ret == 0) {
        MCUX_CSSL_FP_FUNCTION_CALL_BEGIN(res_w, tok_w,
            mcuxClEls_WaitForOperation(MCUXCLELS_ERROR_FLAGS_CLEAR));

        if ((MCUX_CSSL_FP_FUNCTION_CALLED(mcuxClEls_WaitForOperation) != tok_w) ||
            (MCUXCLELS_STATUS_OK != res_w)) {
#ifdef DEBUG
            wolfBoot_printf("[DICE] create_attest_key: WaitForOperation(KEYGEN) failed"
                            " res=0x%x tok=0x%x\r\n",
                            (unsigned)res_w, (unsigned)tok_w);
#endif
            ret = -1;
        }

        MCUX_CSSL_FP_FUNCTION_CALL_END();
    }

    if (ret == 0) {
        XMEMCPY(s_dice_attest_pubkey, pub_key, sizeof(s_dice_attest_pubkey));
        s_dice_attest_pubkey_valid = 1;
    }

    cdi_derivation_count = 0;   /* reset for the next token build */
    XMEMSET(pub_key, 0, sizeof(pub_key));
#ifdef DEBUG
    wolfBoot_printf("[DICE] create_attest_key: ret=%d\r\n", ret);
#endif
    return ret;
}

int hal_dice_get_attest_pubkey(uint8_t *buf, size_t *len)
{
    if (buf == NULL || len == NULL || *len < 65)
        return -1;
    if (!s_dice_attest_pubkey_valid)
        return -1;

    buf[0] = 0x04; /* X9.63 uncompressed prefix */
    XMEMCPY(buf + 1, s_dice_attest_pubkey, sizeof(s_dice_attest_pubkey));
    *len = 65;

    /* Zeroize cached public key after copying out (read-once). */
    hal_dice_zeroize(s_dice_attest_pubkey, sizeof(s_dice_attest_pubkey));
    s_dice_attest_pubkey_valid = 0;

    return 0;
}

int hal_dice_sign_hash(const uint8_t *hash, size_t hash_len,
                       uint8_t *sig, size_t *sig_len)
{
    mcuxClEls_EccSignOption_t opts = {0};
    uint8_t hash_buf[SHA256_DIGEST_SIZE] __attribute__((aligned(4)));
    uint8_t sig_buf[MCUXCLELS_ECC_SIGNATURE_SIZE] __attribute__((aligned(4)));
    int ret = 0;
    _Static_assert(MCUXCLELS_ECC_SIGNATURE_SIZE == 64,
        "MCUXCLELS_ECC_SIGNATURE_SIZE must equal WOLFBOOT_DICE_SIG_LEN (64)");

#ifdef DEBUG
    wolfBoot_printf("[DICE] sign_hash: hash_len=%u\r\n", (unsigned)hash_len);
#endif

    if (hash == NULL || sig == NULL || sig_len == NULL || hash_len != SHA256_DIGEST_SIZE ||
        *sig_len < MCUXCLELS_ECC_SIGNATURE_SIZE) {
#ifdef DEBUG
        wolfBoot_printf("[DICE] sign_hash: invalid args"
                        " hash=%p sig=%p sig_len=%p hash_len=%u\r\n",
                        hash, sig, sig_len, (unsigned)hash_len);
#endif
        ret = -1;
    }

    if (ret == 0) {
        XMEMCPY(hash_buf, hash, SHA256_DIGEST_SIZE);

        /* Set options */
        opts.bits.echashchl = MCUXCLELS_ECC_HASHED;

        /* Trigger the ECC Sign command.
         * We just give the names of token and return value
         * since it's declared within the macro */
        MCUX_CSSL_FP_FUNCTION_CALL_BEGIN(res_sign, tok_sign,
            mcuxClEls_EccSign_Async(opts,
                MCXN_ELS_DICE_IAK_KEYSLOT,
                hash_buf, NULL, 0, sig_buf));

        if ((MCUX_CSSL_FP_FUNCTION_CALLED(mcuxClEls_EccSign_Async) != tok_sign) ||
            (MCUXCLELS_STATUS_OK_WAIT != res_sign)) {
#ifdef DEBUG
            wolfBoot_printf("[DICE] sign_hash: EccSign_Async failed"
                            " res=0x%x tok=0x%x\r\n",
                            (unsigned)res_sign, (unsigned)tok_sign);
#endif
            ret = -1;
        }

        MCUX_CSSL_FP_FUNCTION_CALL_END();

        /* Wait for hardware to finish */
        if (ret == 0) {
            MCUX_CSSL_FP_FUNCTION_CALL_BEGIN(res_w, tok_w,
                mcuxClEls_WaitForOperation(MCUXCLELS_ERROR_FLAGS_CLEAR));

            if ((MCUX_CSSL_FP_FUNCTION_CALLED(mcuxClEls_WaitForOperation) != tok_w) ||
                (MCUXCLELS_STATUS_OK != res_w)) {
#ifdef DEBUG
                wolfBoot_printf("[DICE] sign_hash: WaitForOperation(SIGN) failed"
                                " res=0x%x tok=0x%x\r\n",
                                (unsigned)res_w, (unsigned)tok_w);
#endif
                ret = -1;
            }

            MCUX_CSSL_FP_FUNCTION_CALL_END();
        }
    }

    if (ret == 0) {
        XMEMCPY(sig, sig_buf, MCUXCLELS_ECC_SIGNATURE_SIZE);
        *sig_len = MCUXCLELS_ECC_SIGNATURE_SIZE;
    }

    hal_dice_zeroize(hash_buf, sizeof(hash_buf));
    hal_dice_zeroize(sig_buf, sizeof(sig_buf));
#ifdef DEBUG
    wolfBoot_printf("[DICE] sign_hash: ret=%d\r\n", ret);
#endif
    return ret;
}

#endif /* WOLFCRYPT_TZ_PSA && WOLFBOOT_DICE_HW && __WOLFBOOT */
